Autodesk.Revit.DB.ISiteInsertServer.Insert(Autodesk.Revit.DB.SiteInsertServiceData)
The method that Revit will invoke to perform site insert.
data:
The site insert data.
Returns:
Indicates whether the site insert server is executed successfully.
Since:
2018

Autodesk.Revit.DB.ISiteInsertServer
Interface for external servers implementing site insert.
Since:
2018